{
  "backend/main.mo": "Motoko canister defining user profiles and book project types with access-controlled queries and updates for profiles and structured writing data.",
  "feature_evidence.json": "Feature evidence report mapping new multi-character questionnaire features to affected frontend files and components.",
  "frontend-file-summaries.txt": "Aggregated summaries describing purposes of various frontend files including pages, hooks, components, and styles.",
  "frontend/DRAFT_BUILD.md": "Instructions for building, deploying, and testing the draft featuring the multi-character family questionnaire.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables and theme tokens for light and dark modes.",
  "frontend/index.html": "HTML entry file mounting the root React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app managing authentication, workspace navigation, and project-level questionnaire dialog handling.",
  "frontend/src/components/AppHeader.tsx": "Header component showing branding, optional workspace controls, and hero illustration.",
  "frontend/src/components/bookSetup/BookSetupQuestionnaireDialog.tsx": "Multi‑step dialog for answering and saving book setup questions, including project renaming and loading saved answers.",
  "frontend/src/components/bookSetup/bookSetupQuestions.ts": "Static list of structured book setup questions defining IDs, categories, and selectable options.",
  "frontend/src/components/characters/CharacterQuestionnaire.tsx": "Form component for creating or editing a character with fields for background, motivations, relationships, flaws, voice, and role.",
  "frontend/src/components/characters/CharacterSummary.tsx": "Displays a character’s details in card sections for background, motivations, relationships, flaws, voice, and story role.",
  "frontend/src/components/characters/CreateBandWizardDialog.tsx": "Wizard dialog for creating multiple band members with step-based input, validation, and project character name checks.",
  "frontend/src/components/characters/MultiCharacterQuestionnaireDialog.tsx": "Multi-person questionnaire wizard allowing dynamic person creation, validation, and character import into a project.",
  "frontend/src/components/characters/multiCharacterQuestionnaireTypes.ts": "Defines types and constants for family roles, gender options, and person drafts used in the questionnaire.",
  "frontend/src/components/ExportProjectButton.tsx": "Button component exporting the selected project to Markdown with success and error toasts.",
  "frontend/src/components/ProjectSwitcher.tsx": "UI component for selecting, creating, renaming, deleting projects, and opening their questionnaire.",
  "frontend/src/components/prologue/PrologueEditor.tsx": "Editor for creating or updating a project's prologue sections with form state and save functionality.",
  "frontend/src/components/prologue/PrologueOutlineView.tsx": "Displays a read-only outline of prologue sections and draft content in card layout.",
  "frontend/src/components/WorkspaceMenu.tsx": "Dropdown workspace menu for navigating sections, selecting genres, managing custom categories, and logging out.",
  "frontend/src/components/worldbuilding/WorldbuildingCategoryEditor.tsx": "Editor for worldbuilding categories allowing description edits and note additions tied to a selected project.",
  "frontend/src/config/workspaceMenuItems.ts": "Defines workspace menu item metadata for genres and writing tool sections.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages an authenticated or anonymous backend actor, refreshing dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity auth, including loading, login, logout, and status tracking using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating project, character, and related backend data via an actor API.",
  "frontend/src/index.css": "Tailwind CSS setup defining light and dark theme variables and base typography styles.",
  "frontend/src/lib/exportProject.ts": "Generates a markdown export of a project’s characters, worldbuilding, and prologue, then triggers a file download.",
  "frontend/src/main.tsx": "App entry point initializing React, React Query, and the Internet Identity provider before rendering the app.",
  "frontend/src/sections/CharactersPage.tsx": "UI page for listing, creating, and editing characters with dialogs and summary views.",
  "frontend/src/sections/ProloguePage.tsx": "Displays prologue editing and outline tabs for the selected project’s opening section.",
  "frontend/src/sections/WorldbuildingPage.tsx": "Worldbuilding editor page showing expandable categories with prompts and saved data.",
  "frontend/src/state/useProjects.ts": "Manages project list and selected project state with localStorage persistence and auto-selection logic.",
  "frontend/src/state/useWorkspaceCategories.ts": "Handles built‑in and custom workspace categories, including localStorage persistence and ID-safe creation.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/src/views/HomeView.tsx": "Landing page showing branding and sign‑up/login entry points.",
  "frontend/src/views/LoginView.tsx": "Login screen using Internet Identity with error handling and loading states.",
  "frontend/src/views/SignUpView.tsx": "Sign‑up screen using Internet Identity with similar UI and error handling as login.",
  "frontend/tailwind.config.js": "Tailwind configuration extending themes, colors, animations, and plugins.",
  "project_state.json": "Project metadata describing multi‑character questionnaire features, issues, and requirements."
}