{
  "backend/main.mo": "Motoko actor implementing access-controlled user profiles and complex book project types including characters, worldbuilding, and prologue data with helpers for viewing and saving.",
  "feature_evidence.json": "Structured feature evidence report linking features to affected frontend files, components, and test IDs with high confidence metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries of key frontend files describing application structure, pages, hooks, components, and styling.",
  "frontend/DRAFT_BUILD.md": "Draft build instructions and QA checklist for testing the multi‑character family questionnaire feature.",
  "frontend/index.css": "Tailwind base and theme variable definitions configuring light and dark color palettes and global styles.",
  "frontend/index.html": "HTML entry point loading the React app root and main script.",
  "frontend/src/App.tsx": "Main React application orchestrating auth flow, workspace navigation, project selection, and opening the book setup questionnaire.",
  "frontend/src/components/AppHeader.tsx": "Header component showing app branding and optional workspace controls with hero image for unauthenticated views.",
  "frontend/src/components/bookSetup/BookSetupQuestionnaireDialog.tsx": "A multi-step dialog for answering and saving book setup questions, including loading/saving previous answers and renaming the project.",
  "frontend/src/components/bookSetup/bookSetupQuestions.ts": "Defines the list of book setup questions and options for project, character, worldbuilding, and prologue categories.",
  "frontend/src/components/characters/CharacterQuestionnaire.tsx": "Provides a form for creating or editing a character with fields for background, motivations, relationships, flaws, voice, and role.",
  "frontend/src/components/characters/CharacterSummary.tsx": "Renders a read-only summary of a character grouped into background, motivations, relationships, flaws, voice, and story role.",
  "frontend/src/components/characters/CreateBandWizardDialog.tsx": "Wizard dialog for creating multiple band members, handling steps, validation, and submission to create characters in a project.",
  "frontend/src/components/characters/FamilyQuestionnaireQuestionFlow.tsx": "Component that displays and navigates through a multi-step family questionnaire for a single person, managing answers and progress.",
  "frontend/src/components/characters/familyQuestionnaireQuestions.ts": "Defines structured questionnaire sections and questions with options used for the family character questionnaire.",
  "frontend/src/components/characters/familyQuestionnaireTextGenerator.ts": "Generates character background and trait text from questionnaire answers using deterministic formatting helpers.",
  "frontend/src/components/characters/familyQuestionnaireTypes.ts": "Type definitions for questionnaire answers and per-person answer structures, including main-character and parent metadata.",
  "frontend/src/components/characters/MultiCharacterQuestionnaireDialog.tsx": "Dialog that manages multi-character setup and detailed questionnaire flow, including person management, main character selection, and final creation.",
  "frontend/src/components/characters/multiCharacterQuestionnaireTypes.ts": "Defines types and constants for multi-character questionnaire roles, genders, and draft character structures.",
  "frontend/src/components/ExportProjectButton.tsx": "Button that exports the selected project to a downloadable Markdown file using exportProject().",
  "frontend/src/components/ProjectSwitcher.tsx": "Manages project creation, selection, renaming, deletion, and optionally opens a questionnaire after creating a project.",
  "frontend/src/components/prologue/PrologueEditor.tsx": "Editor UI for creating and updating prologue fields, saving data via mutations, and managing local form state.",
  "frontend/src/components/prologue/PrologueOutlineView.tsx": "Displays a read‑only summary of prologue sections and draft content if available.",
  "frontend/src/components/WorkspaceMenu.tsx": "Displays a workspace dropdown with genre and tool categories, supports adding/removing custom categories, and handles logout/navigation.",
  "frontend/src/components/worldbuilding/WorldbuildingCategoryEditor.tsx": "Editor for a worldbuilding category allowing description updates and adding quick notes via mutations.",
  "frontend/src/config/workspaceMenuItems.ts": "Defines the list of workspace sidebar menu items grouped into genres and tools.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handling login, stored identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks wrapping backend actor methods for projects, characters, and other project data operations.",
  "frontend/src/index.css": "Tailwind base styles plus light and dark theme CSS variables for the app’s color system.",
  "frontend/src/lib/exportProject.ts": "Generates a Markdown export of a book project including characters, worldbuilding, and prologue, then triggers a file download.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/sections/CharactersPage.tsx": "Displays and manages character creation, editing, and questionnaires within the selected project.",
  "frontend/src/sections/ProloguePage.tsx": "Shows editor and outline tabs for creating and reviewing a project's prologue.",
  "frontend/src/sections/WorldbuildingPage.tsx": "Renders editable worldbuilding categories using accordions tied to the selected project.",
  "frontend/src/state/useProjects.ts": "Manages loading, selecting, and persisting the active project using query hooks and localStorage.",
  "frontend/src/state/useWorkspaceCategories.ts": "Handles custom and built‑in workspace categories including persistence, creation, and lookup utilities.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, and clearing URL and session-based parameters.",
  "frontend/src/views/HomeView.tsx": "Landing view with branding and sign‑up/login actions for new or returning users.",
  "frontend/src/views/LoginView.tsx": "React view that renders a login screen using Internet Identity with error handling and a loading state.",
  "frontend/src/views/SignUpView.tsx": "React view that renders a signup screen using Internet Identity with error handling and a loading indicator.",
  "frontend/tailwind.config.js": "TailwindCSS configuration extending theme colors, fonts, animations, and enabling typography, container queries, and animate plugins.",
  "project_state.json": "JSON describing project requirements and issues for converting a family questionnaire into a structured multiple-choice system with enforced parent-child relationships."
}