{
  "backend/main.mo": "Defines the main actor with access control, user profile management, and comprehensive types for characters, worldbuilding, prologues, and book projects.",
  "backend/migration.mo": "Provides type definitions mirroring backend state and a no-op migration function returning the previous actor state.",
  "feature_evidence.json": "Lists feature evidence entries linking features to relevant frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for numerous frontend files describing their roles in the app.",
  "frontend/DRAFT_BUILD.md": "Instructions for building and testing the draft multi-character family questionnaire feature.",
  "frontend/index.css": "Defines global Tailwind-based styles and color variables for light and dark themes.",
  "frontend/index.html": "Basic HTML shell loading the React application root and main script.",
  "frontend/src/App.tsx": "Main app component handling auth flow, workspace navigation, and opening the book setup questionnaire.",
  "frontend/src/components/AppHeader.tsx": "Renders the application header with branding and optional workspace controls.",
  "frontend/src/components/bookSetup/BookSetupQuestionnaireDialog.tsx": "Multi‑step dialog for answering book setup questions, renaming the project, and saving structured answers.",
  "frontend/src/components/bookSetup/bookSetupQuestions.ts": "Defines the list of book setup questions, options, and metadata for character, worldbuilding, and prologue setup.",
  "frontend/src/components/characters/BandQuestionnaireFlow.tsx": "Manages per-member band questionnaire navigation and input handling, supporting text, textarea, radio options, and custom inputs.",
  "frontend/src/components/characters/bandQuestionnaireQuestions.ts": "Defines question banks for creating a band/group, including group-level and per-member questionnaire items.",
  "frontend/src/components/characters/bandQuestionnaireTextGenerator.ts": "Generates character text fields for band members using their questionnaire answers and group-wide details.",
  "frontend/src/components/characters/CharacterHub.tsx": "Displays up to 150 character slots with filled or empty cards and triggers selection actions.",
  "frontend/src/components/characters/CharacterQuestionnaire.tsx": "Provides a form for creating or editing a character with accordion sections and submits data via API hooks.",
  "frontend/src/components/characters/CharacterQuestionnaireFlowDialog.tsx": "Guides users through multi‑module character questionnaires with progress saving, previewing, and final character creation.",
  "frontend/src/components/characters/characterQuestionnaires/characterProfileGenerator.ts": "Builds a full character profile by combining module answers and custom inputs into narrative sections.",
  "frontend/src/components/characters/characterQuestionnaires/characterQuestionnaireTypes.ts": "Provides TypeScript types for questionnaire structures, questions, answers, and progress state.",
  "frontend/src/components/characters/characterQuestionnaires/coreCharacterQuestions.ts": "Defines the core character questionnaire module with identity and family background questions.",
  "frontend/src/components/characters/characterQuestionnaires/moduleRegistry.ts": "Exports a list of all questionnaire modules, including core, personality, and style.",
  "frontend/src/components/characters/characterQuestionnaires/personalityQuestions.ts": "Defines the personality questionnaire module with multiple radio-based questions covering communication, conflict, decision-making, trust, humor, emotions, social energy, and responses to change.",
  "frontend/src/components/characters/characterQuestionnaires/styleQuestions.ts": "Creates the style questionnaire module with questions about fashion, colors, accessories, grooming, body language, voice tone, speech patterns, and living space.",
  "frontend/src/components/characters/CharacterSummary.tsx": "Renders a character’s major narrative sections in a card-based summary layout.",
  "frontend/src/components/characters/CreateBandWizardDialog.tsx": "Multi-step wizard for creating a band, collecting group info and individual member details, then generating multiple characters.",
  "frontend/src/components/characters/FamilyQuestionnaireQuestionFlow.tsx": "Handles sequential family questionnaire questions with radio, checkbox, and custom input logic, advancing across people.",
  "frontend/src/components/characters/familyQuestionnaireQuestions.ts": "Provides typed family questionnaire question definitions, sections, and options for background, identity, traits, relationships, goals, and other character attributes.",
  "frontend/src/components/characters/familyQuestionnaireTextGenerator.ts": "Generates deterministic narrative text for a character using questionnaire answers, producing background, motivations, relationships, flaws, voice, and story-role sections.",
  "frontend/src/components/characters/familyQuestionnaireTypes.ts": "Defines TypeScript types for storing family questionnaire answers, including value formats, custom inputs, and metadata for each person.",
  "frontend/src/components/characters/MultiCharacterQuestionnaireDialog.tsx": "React dialog wizard for creating multiple characters, managing steps, person entries, main character selection, and questionnaire data updates.",
  "frontend/src/components/characters/multiCharacterQuestionnaireTypes.ts": "Declares types and constants for multi-character questionnaires, including family roles, gender options, person drafts, and questionnaire state.",
  "frontend/src/components/ExportProjectButton.tsx": "Button that exports the currently selected project and shows toast notifications.",
  "frontend/src/components/ProjectSwitcher.tsx": "Provides UI for creating, selecting, renaming, and deleting projects, with optional questionnaire launch.",
  "frontend/src/components/prologue/PrologueEditor.tsx": "Implements an editor UI for creating and saving prologue sections with form fields, accordions, and project-linked persistence.",
  "frontend/src/components/prologue/PrologueOutlineView.tsx": "Renders a read-only outline of a prologue, showing sections like hook, POV, stakes, key reveals, and the optional full draft.",
  "frontend/src/components/WorkspaceMenu.tsx": "Dropdown workspace menu for navigating sections, selecting genres, managing custom categories, and logging out.",
  "frontend/src/components/worldbuilding/WorldbuildingCategoryEditor.tsx": "Component for editing a worldbuilding category’s description and adding notes using project-specific mutations.",
  "frontend/src/config/workspaceMenuItems.ts": "Defines workspace menu item types and a list of genre and tool menu entries with icons.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading stored identities and handling login/logout state.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating project, character, and worldbuilding data via the backend actor.",
  "frontend/src/index.css": "Tailwind base styles with custom light/dark theme variables and typography settings.",
  "frontend/src/lib/exportProject.ts": "Generates a Markdown export of a project’s characters, worldbuilding, and prologue, then triggers a file download.",
  "frontend/src/main.tsx": "Application entry point setting up React Query, identity provider, and rendering the app.",
  "frontend/src/sections/CharactersPage.tsx": "Renders the character hub with slot interactions and dialogs for creating, editing, and grouping characters. Manages various UI states for questionnaires and character selection.",
  "frontend/src/sections/ProloguePage.tsx": "Provides an editor and outline view for the project's prologue using tabbed navigation within a card layout.",
  "frontend/src/sections/WorldbuildingPage.tsx": "Displays expandable worldbuilding categories and editors populated from the current project's data. Uses an accordion to manage category sections and their prompts.",
  "frontend/src/state/useProjects.ts": "Manages project selection, persistence, and retrieval using query hooks and localStorage. Auto-selects a project and clears invalid selections.",
  "frontend/src/state/useWorkspaceCategories.ts": "Handles built‑in and custom workspace categories with localStorage persistence. Supports adding, removing, and querying category metadata.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/src/views/HomeView.tsx": "Landing page with branding, a brief app description, and sign‑up/login buttons. Encourages users to begin creating stories.",
  "frontend/src/views/LoginView.tsx": "Login form using Internet Identity with loading, error handling, and back navigation. Wraps login flow in a card layout.",
  "frontend/src/views/SignUpView.tsx": "Sign‑up view using Internet Identity with error handling and a similar layout to login. Initiates account creation via the same login hook.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, custom theme extensions, and plugins for typography, container queries, and animations.",
  "project_state.json": "Stores project state, including feature requirements for a new band/group questionnaire flow and expanded member limits."
}