{
  "backend/main.mo": "Defines types and CRUD logic for book projects, including characters, worldbuilding categories, and prologue, with conversion helpers for returning view models.",
  "feature_evidence.json": "Lists implemented features, associated source files, components used, test IDs, and confidence levels for the project's feature set.",
  "frontend-file-summaries.txt": "Provides short descriptions of all major frontend files, summarizing their purpose within the React application.",
  "frontend/index.css": "Defines global Tailwind-based styles using warm OKLCH color tokens for light and dark themes.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app shell handling theme, project selection, navigation tabs, and page rendering for characters, worldbuilding, and prologue.",
  "frontend/src/components/AppHeader.tsx": "Renders the app header with logo, title, and a decorative hero image.",
  "frontend/src/components/characters/CharacterQuestionnaire.tsx": "A form component for creating a character with multiple text sections and submission via addCharacter mutation.",
  "frontend/src/components/characters/CharacterSummary.tsx": "Displays a character’s filled sections in card format, showing background, motivations, relationships, flaws, voice, and role.",
  "frontend/src/components/ExportProjectButton.tsx": "Button that exports the selected project as a Markdown file with toast notifications.",
  "frontend/src/components/ProjectSwitcher.tsx": "Dropdown UI for creating, selecting, renaming, and deleting projects with dialog prompts and backend calls.",
  "frontend/src/components/prologue/PrologueEditor.tsx": "Editor for writing and saving prologue sections with accordion-based inputs and savePrologue mutation.",
  "frontend/src/components/prologue/PrologueOutlineView.tsx": "Shows a read‑only outline of the prologue sections and an optional draft if present.",
  "frontend/src/components/worldbuilding/WorldbuildingCategoryEditor.tsx": "Allows editing a worldbuilding category’s description and adding notes using update and add mutations.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context for Internet Identity login, logout, identity storage, and authentication state management.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks wrap actor calls to fetch and mutate project, character, and worldbuilding data with cache invalidation.",
  "frontend/src/index.css": "Tailwind base styles with custom CSS variables for light and dark themes and typography tweaks.",
  "frontend/src/lib/exportProject.ts": "Generates a Markdown export of a project’s characters, worldbuilding, and prologue, then triggers a file download.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/sections/CharactersPage.tsx": "UI for listing, creating, and viewing characters using dialogs and questionnaire/summary components.",
  "frontend/src/sections/ProloguePage.tsx": "Provides editor and outline tabs for viewing and editing a project's prologue.",
  "frontend/src/sections/WorldbuildingPage.tsx": "Displays worldbuilding categories in an accordion with editors for each section.",
  "frontend/src/state/useProjects.ts": "Manages project selection, persistence, and loading using React state and project-fetching hooks.",
  "frontend/tailwind.config.js": "Tailwind config defining theme extensions for colors, typography, containers, animations, and including typography, container-queries, and animate plugins.",
  "project_state.json": "Project state metadata describing the book‑writing web app, its features, requirements, and image needs for the UI."
}