{
  "kind": "build_request",
  "title": "Add dedicated Band/Group questionnaire and increase member count limit",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Replace the current freeform “Create Band/Group” flow with a dedicated Band/Group questionnaire flow that is separate from the existing single-character questionnaire and the family questionnaire.\n\nThe Band/Group flow must:\n- Ask at least one band/group-level setup section (e.g., group name and basic concept) and then run a per-member questionnaire section.\n- Produce the same final output as today: create multiple Characters in the selected project (name, background, motivations, relationships, flaws, voice, storyRole).\n- Keep user-facing text in English.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "The create a  Band/ Group  needs  its own questionnaire"
        ]
      },
      "acceptanceCriteria": [
        "Opening “Create Band/Group” starts a multi-step questionnaire flow (not the current accordion of freeform textareas).",
        "The flow includes at least one band/group-level step and at least one per-member step.",
        "Completing the flow creates one Character per member in the currently selected project and the new characters appear in the Character Hub."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Increase the Band/Group member count selection limit to support large groups beyond 7 members.\n\nUpdate the Band/Group member-count UI to allow a configurable maximum of at least 45 members, and ensure the flow remains usable at that size (basic validation and navigation still work).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "the Members choice needs to go past 7"
        ]
      },
      "acceptanceCriteria": [
        "The “Number of Members” input in the Band/Group flow allows values greater than 7.",
        "The maximum selectable member count is at least 45.",
        "At 17 members and at 45 members, the user can proceed through member steps and complete creation without client-side validation breaking."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add a backend batch API to create multiple characters in one call, and update the frontend Band/Group creation to use it.\n\nThe batch API must:\n- Accept a projectId and an array of characters (name, background, motivations, relationships, flaws, voice, storyRole).\n- Enforce project access control consistent with existing project mutation methods.\n- Create all characters in the project within the single call.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "some bands of 45 people and some K-pop groups or even more like 17"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a single method for adding multiple characters to a project in one request.",
        "Frontend Band/Group creation uses the batch method instead of calling addCharacter repeatedly.",
        "Creating a 45-member group completes successfully without requiring 45 separate backend calls."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/immutablePaths (e.g., frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui).",
    "Backend must remain a single-actor Motoko canister; do not introduce additional backend services."
  ],
  "nonGoals": [
    "Do not add third-party authentication methods (Internet Identity only).",
    "Do not add real-time features (no WebSockets/chat).",
    "Do not introduce external databases or off-chain storage."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}