{
  "kind": "build_request",
  "title": "Create a multi-character “giant questionnaire” that generates character profiles (new draft build)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a new multi-character questionnaire flow that lets the user define and fill out multiple character profiles in one continuous guided questionnaire, with an emphasis on family-tree style grouping (e.g., mothers, fathers, grandparents, kids; plus male/female/other distinctions) so the user can complete all characters at once instead of repeating the same questions per character.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-8"
        ],
        "quotes": [
          "The update will consist of a way to when it's asking you questions about your character you can do all your characters at once but break it down into specific traits with different ones male female kids mothers father's grandparents kind of like that family tree background kind of but I want it to be able to create the character profiles out of that questionnaire..."
        ]
      },
      "acceptanceCriteria": [
        "From the Characters section, the user can open a new multi-character questionnaire designed for building multiple related characters in one flow.",
        "The flow provides a way to group characters by family-tree roles (at minimum: mother, father, grandparent, child/kid, and an 'other' option) and capture per-character trait/background information without requiring the user to re-answer the same prompts for each character separately.",
        "All user-facing UI text for this feature is in English."
      ]
    },
    {
      "id": "REQ-2",
      "text": "When the multi-character questionnaire is submitted, automatically create separate character profiles in the currently selected project (one saved character per person defined in the questionnaire), and refresh the Characters list to show the newly created characters immediately.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-8"
        ],
        "quotes": [
          "...I want it to be able to create the character profiles out of that questionnaire so you don't have to go back and redo the question in every single character..."
        ]
      },
      "acceptanceCriteria": [
        "Submitting the multi-character questionnaire results in multiple distinct characters being created in the selected project.",
        "After successful creation, the Characters page displays the new characters without a manual refresh (React Query cache invalidation or equivalent).",
        "If no project is selected, the UI blocks submission and shows an English error message."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Integrate the new multi-character questionnaire entry point into the existing Characters page UI alongside the current single-character creation and the existing “Create Band/Group” wizard, so users can choose the appropriate creation mode.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "...do all your characters at once..."
        ]
      },
      "acceptanceCriteria": [
        "CharactersPage includes a clear button/entry point to open the new multi-character questionnaire dialog.",
        "Existing flows (New Character and Create Band/Group) remain available and continue to work as before."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Produce and deploy a new draft build of the app after implementing the multi-character questionnaire update so the user can test it.",
      "target": "unknown",
      "source": {
        "messageIds": [
          "msg-12"
        ],
        "quotes": [
          "Send me a new draft"
        ]
      },
      "acceptanceCriteria": [
        "A new draft build is produced that includes the multi-character questionnaire functionality described in this build request."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; do not introduce additional backend services.",
    "Do not modify files under frontend/src/components/ui or any paths listed as immutable: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Do not add third-party authentication providers (only Internet Identity is supported).",
    "Do not add real-time collaboration/chat features.",
    "Do not redesign unrelated sections (Projects, Worldbuilding, Prologue) beyond what is necessary to add the new questionnaire entry point."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}