{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Multi-character family-tree questionnaire (draft build)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Implement a new guided, multi-character questionnaire flow that groups characters by family-tree roles and captures per-character traits in one continuous experience.",
      "acceptanceCriteria": [
        "From the Characters section, the user can open a new multi-character questionnaire designed for building multiple related characters in one flow.",
        "The flow provides a way to group characters by family-tree roles (at minimum: mother, father, grandparent, child/kid, and an 'other' option) and capture per-character trait/background information without requiring the user to re-answer the same prompts for each character separately.",
        "All user-facing UI text for this feature is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/characters/MultiCharacterQuestionnaireDialog.tsx",
          "operation": "create",
          "description": "Create a new multi-character questionnaire dialog that (1) lets the user add multiple people, (2) assigns each person a family-tree role (mother/father/grandparent/child/other) plus a gender marker (male/female/other), and (3) provides a continuous guided flow that supports reusing shared answers (e.g., a 'apply to selected/all' toggle for repeated prompts) while still allowing per-person overrides. Use shadcn-ui primitives (e.g., Dialog, Accordion, Tabs/Select where available) to keep styling consistent. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/characters/multiCharacterQuestionnaireTypes.ts",
          "operation": "create",
          "description": "Add lightweight frontend-only types/constants for the multi-character questionnaire (family roles list, gender options, and the in-memory draft model used by the dialog) to keep the dialog component readable and ensure all labels are in English."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "On submit, create one saved character per defined person in the selected project and refresh the Characters list immediately; block submit when no project is selected.",
      "acceptanceCriteria": [
        "Submitting the multi-character questionnaire results in multiple distinct characters being created in the selected project.",
        "After successful creation, the Characters page displays the new characters without a manual refresh (React Query cache invalidation or equivalent).",
        "If no project is selected, the UI blocks submission and shows an English error message."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/characters/MultiCharacterQuestionnaireDialog.tsx",
          "operation": "modify",
          "description": "Wire submission to existing React Query mutations by using the existing multi-create behavior (e.g., useCreateMultipleCharacters) and ensure successful completion closes the dialog and triggers immediate Characters list refresh via existing cache invalidation. Add an explicit guard that blocks submission when no project is selected and shows an English error (toast or inline). Map questionnaire role/gender into saved Character fields consistently (e.g., storyRole and/or relationships/background) so each created character remains distinct and recognizable. Use shadcn-ui feedback patterns where applicable (buttons disabled while pending). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "If needed for correctness/UX, extend the existing multi-create mutation behavior to better support the new questionnaire (e.g., accept the new draft shape via a small adapter, ensure invalidation covers ['projects'] and ['project', projectId], and keep errors surfaced to the UI). Keep all user-facing strings in English."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add an entry point on CharactersPage to open the new multi-character questionnaire alongside existing New Character and Create Band/Group flows.",
      "acceptanceCriteria": [
        "CharactersPage includes a clear button/entry point to open the new multi-character questionnaire dialog.",
        "Existing flows (New Character and Create Band/Group) remain available and continue to work as before."
      ],
      "file_operations": [
        {
          "path": "frontend/src/sections/CharactersPage.tsx",
          "operation": "modify",
          "description": "Add a new UI action (button) next to existing 'New Character' and 'Create Band/Group' actions to open the multi-character questionnaire dialog, and add the dialog instance/state wiring so it is reachable (not an orphan component). Ensure button text is English and existing flows remain unchanged. Verify shadcn-ui component usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Prepare the frontend project for producing a new draft build containing the multi-character questionnaire update.",
      "acceptanceCriteria": [
        "A new draft build is produced that includes the multi-character questionnaire functionality described in this build request."
      ],
      "file_operations": [
        {
          "path": "frontend/DRAFT_BUILD.md",
          "operation": "create",
          "description": "Document the steps to produce a new draft build for testing (how to run the frontend build, how to verify the multi-character questionnaire appears in Characters, and a short checklist confirming English UI text and that created characters appear immediately after submit). Keep instructions focused on this feature and do not reference or include any sensitive content."
        }
      ]
    }
  ]
}