{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Dedicated Band/Group questionnaire flow + larger member counts + batch creation usage",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Replace the Band/Group creation UI with a dedicated multi-step questionnaire that includes group-level setup and per-member questions, producing one Character per member.",
      "acceptanceCriteria": [
        "Opening “Create Band/Group” starts a multi-step questionnaire flow (not the current accordion of freeform textareas).",
        "The flow includes at least one band/group-level step and at least one per-member step.",
        "Completing the flow creates one Character per member in the currently selected project and the new characters appear in the Character Hub."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/characters/CreateBandWizardDialog.tsx",
          "operation": "modify",
          "description": "Replace the current count+accordion UI with a dedicated Band/Group questionnaire wizard that includes (1) band/group-level setup step(s) (e.g., group name + concept) and (2) a per-member guided question flow (linear navigation with progress). Use shadcn-ui Dialog/Button/Input/Textarea/Progress (and other existing shadcn-ui primitives as needed) to implement the steps and navigation. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/characters/bandQuestionnaireQuestions.ts",
          "operation": "create",
          "description": "Add a structured question bank for the Band/Group flow, separating group-level questions (e.g., group name, concept, genre/vibe) from per-member questions that map to the required Character fields (background, motivations, relationships, flaws, voice, storyRole). Keep all user-facing text in English."
        },
        {
          "path": "frontend/src/components/characters/BandQuestionnaireFlow.tsx",
          "operation": "create",
          "description": "Create a reusable per-member question flow component (similar to the existing family question flow pattern) that renders questions from bandQuestionnaireQuestions.ts, tracks progress, and provides Next/Previous navigation with basic validation (at least name required per member). Use shadcn-ui form primitives and Progress to keep the flow usable. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/characters/bandQuestionnaireTextGenerator.ts",
          "operation": "create",
          "description": "Implement a generator that converts band/group setup answers + per-member answers into final CharacterInput objects (name, background, motivations, relationships, flaws, voice, storyRole), ensuring the output matches the fields used by the existing Character Hub and summary views."
        },
        {
          "path": "frontend/src/sections/CharactersPage.tsx",
          "operation": "modify",
          "description": "Ensure the “Create Band/Group” action continues to open the updated dedicated Band/Group questionnaire flow (via the existing CreateBandWizardDialog import) and that the dialog close/completion behavior still returns the user to the Character Hub with newly created characters visible."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Increase the Band/Group member count selection limit to a configurable max of at least 45 and keep the flow usable at large sizes.",
      "acceptanceCriteria": [
        "The “Number of Members” input in the Band/Group flow allows values greater than 7.",
        "The maximum selectable member count is at least 45.",
        "At 17 members and at 45 members, the user can proceed through member steps and complete creation without client-side validation breaking."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/characters/CreateBandWizardDialog.tsx",
          "operation": "modify",
          "description": "Update the member-count step to allow selecting >7 up to a configurable maximum (set to at least 45). Add guardrails for usability at 17/45 (e.g., clamped numeric input, clear progress indicator, ability to navigate forward/back across members without excessive UI rendering). Use shadcn-ui Input/Progress/Button where applicable. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/characters/BandQuestionnaireFlow.tsx",
          "operation": "modify",
          "description": "Ensure per-member navigation and validation remain robust at large member counts (e.g., no reliance on rendering all members at once; keep state updates performant; enforce name uniqueness checks and required fields without breaking at 45). Use shadcn-ui components already adopted in the flow. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Update frontend Band/Group creation to use the backend batchCreateCharacters capability instead of repeated single-character calls.",
      "acceptanceCriteria": [
        "Backend exposes a single method for adding multiple characters to a project in one request.",
        "Frontend Band/Group creation uses the batch method instead of calling addCharacter repeatedly.",
        "Creating a 45-member group completes successfully without requiring 45 separate backend calls."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update the existing useAddMultipleCharacters mutation to call the backend batchCreateCharacters capability with a single request (projectId + CharacterInput[]), instead of looping over addCharacter. Keep existing query invalidation behavior so the Character Hub refreshes after creation."
        },
        {
          "path": "frontend/src/components/characters/CreateBandWizardDialog.tsx",
          "operation": "modify",
          "description": "Ensure Band/Group completion submits the generated CharacterInput[] via the updated useAddMultipleCharacters hook (single batch call), and handles success/failure with toasts without triggering per-character requests. Use existing shadcn-ui dialog actions for disabled/loading states. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}