{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Family Questionnaire: 50-question multiple-choice flow with deterministic character generation and main-character parent linkage",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Replace the per-person free-text details step with a ~50-question multiple-choice flow (with Back/Next, progress, and optional short “Other” inputs).",
      "acceptanceCriteria": [
        "Opening Characters → Family Questionnaire no longer shows long free-text Textarea sections for background/motivations/relationships/flaws/voice/story role in the per-person details step.",
        "Each person goes through a multiple-choice question flow (radio/select/checkbox style) with approximately 50 questions available (can be grouped into sections with progress).",
        "Questions support an “Other (custom)” option where appropriate, using a short input only for that option (not long-form writing).",
        "Users can navigate Back/Next through the question flow and see which question/section they are on."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/characters/MultiCharacterQuestionnaireDialog.tsx",
          "operation": "modify",
          "description": "Replace the current Accordion + long Textarea-based per-person 'details' UI with a guided, question-by-question multiple-choice flow driven by the family questionnaire question bank. Use shadcn-ui form primitives (e.g., RadioGroup/Select/Checkbox/Progress) to render question types and show step/section progress. Include Back/Next navigation per question and section indicators. Implement “Other (custom)” as a short input shown only when the selected option allows custom input. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/characters/FamilyQuestionnaireQuestionFlow.tsx",
          "operation": "create",
          "description": "Create a reusable renderer component for the per-person question flow that supports radio/select/checkbox question types, displays progress and section headers, and exposes callbacks for saving answers per question ID (including optional custom input). This component must be used by MultiCharacterQuestionnaireDialog (no orphan component). Use shadcn-ui building blocks for consistent UI. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Introduce a dedicated, reusable family questionnaire question bank with stable IDs and a typed per-person answer model; render UI from the bank and persist answers while navigating within the wizard.",
      "acceptanceCriteria": [
        "Family questionnaire questions are defined in a separate module (not hardcoded inline in the dialog JSX) with stable IDs and typed definitions.",
        "The UI renders questions from the question bank and stores answers keyed by question ID per person.",
        "Answers persist while moving between people inside the wizard (no accidental resets when navigating Next/Back within the dialog)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/characters/familyQuestionnaireQuestions.ts",
          "operation": "create",
          "description": "Create the Family Questionnaire question bank module (similar structure to frontend/src/components/bookSetup/bookSetupQuestions.ts) defining ~50 structured questions with stable IDs, section/category grouping, type (radio/select/checkbox), options (including allow-custom-input where appropriate), and display labels. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/characters/familyQuestionnaireTypes.ts",
          "operation": "create",
          "description": "Create typed definitions for the family questionnaire answer model (e.g., per-person answers keyed by stable question IDs, checkbox multi-select values, and optional custom inputs) and any helper types needed by the flow renderer and dialog. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/characters/multiCharacterQuestionnaireTypes.ts",
          "operation": "modify",
          "description": "Extend PersonDraft to include the per-person answers map keyed by question ID (and custom input values where applicable) so answers persist across Back/Next navigation and when switching between people in the wizard. Also extend the draft model to store main-character designation and parent selection needed for validation. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/characters/MultiCharacterQuestionnaireDialog.tsx",
          "operation": "modify",
          "description": "Wire the dialog to load questions from the new family questionnaire question bank module and store answers per person keyed by stable question IDs (no inline hardcoding). Ensure state updates do not reset answers when moving between questions or between people. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Deterministically generate each character’s saved background/motivations/relationships/flaws/voice/storyRole text from multiple-choice selections on Finish.",
      "acceptanceCriteria": [
        "On “Create All Characters”, each created character has non-empty, readable content in the saved Character fields derived from the chosen options.",
        "The generated text is deterministic and based on the user’s selections (same selections produce the same output).",
        "The Characters list and CharacterSummary view show the generated character details after creation."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/characters/familyQuestionnaireTextGenerator.ts",
          "operation": "create",
          "description": "Create a deterministic text generation utility that takes a person's answer model (plus family setup inputs like role and parent selections) and returns coherent, non-empty strings for background, motivations, relationships, flaws, voice, and storyRole. Ensure the output is purely derived from inputs (no randomness) and consistently formats section text for readability. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/characters/MultiCharacterQuestionnaireDialog.tsx",
          "operation": "modify",
          "description": "On “Create All Characters”, replace usage of free-text draft fields with generated strings from familyQuestionnaireTextGenerator for each person, and pass those generated fields into the existing create-multiple mutation so Character records contain complete details without manual writing. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Capture and enforce main-character parent linkage: exactly one main character, must have at least one parent selected among other people; block finishing and guide the user to fix missing selection; reflect linkage in generated output.",
      "acceptanceCriteria": [
        "In the Family Questionnaire setup step, the user can designate exactly one person as the “Main Character”.",
        "The flow requires selecting at least one parent for the main character from other people in the questionnaire before allowing “Create All Characters”.",
        "If the user tries to finish without satisfying the rule, the UI shows a clear validation error in English and focuses the user back to the missing selection.",
        "The generated character output reflects the relationship (e.g., main character relationships/storyRole text includes the chosen parent(s) and explicitly indicates son/daughter)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/characters/MultiCharacterQuestionnaireDialog.tsx",
          "operation": "modify",
          "description": "Update the setup step UI to allow selecting exactly one person as Main Character and selecting at least one parent for that main character from the other created people. Add finish-time validation that blocks “Create All Characters” unless the constraint is satisfied; show a clear English validation message and programmatically navigate the user back to the setup step and focus/scroll to the missing selection control. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/characters/familyQuestionnaireTextGenerator.ts",
          "operation": "modify",
          "description": "Incorporate main-character parent linkage into deterministic generated text (relationships and/or storyRole) so it explicitly states the main character is the selected son/daughter of the chosen parent(s) by name. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Add explicit Son/Daughter family roles and require the main character’s role to be Son or Daughter for validation and generated output.",
      "acceptanceCriteria": [
        "Family role options include explicit “Son” and “Daughter” choices (in addition to existing roles like mother/father/grandparent/other).",
        "When a person is marked as the main character, the UI requires choosing either Son or Daughter for that person (or an equivalent explicit child role that maps to son/daughter in output).",
        "The created character’s storyRole (or relationships) text clearly indicates son/daughter and references the selected parent(s)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/characters/multiCharacterQuestionnaireTypes.ts",
          "operation": "modify",
          "description": "Expand FAMILY_ROLES to include explicit 'son' and 'daughter' options and update FamilyRole typing accordingly, keeping existing roles intact. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/characters/MultiCharacterQuestionnaireDialog.tsx",
          "operation": "modify",
          "description": "Update setup-step validation so that if a person is selected as Main Character, their family role must be Son or Daughter (and disallow finishing until satisfied). Ensure the UI clearly prompts the user to choose Son/Daughter for the main character and that the selection is used for the parent-link validation and subsequent generation. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/characters/familyQuestionnaireTextGenerator.ts",
          "operation": "modify",
          "description": "Ensure generated storyRole/relationships text uses explicit “son”/“daughter” phrasing (derived from the selected role) and references the chosen parent(s) to satisfy output requirements. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}